quest_system_106210205_name=^?^Enchanted Love
quest_system_106210205_stage_0=^?^Go to Marshan Swamp and find a frog.
quest_system_106210205_stage_1=^?^Bring the frog to the earl.
quest_system_106210205_stage_2=^?^Find Helga's cave and inquire about the Love Potion.
quest_system_106210205_stage_3=^?^Bring the Love Potion to the earl.
quest_system_106210205_task=^?^Earl Argus asks you to bring him a frog from the swamp. He plans to turn it into a princess.<br>[reward]
